[
	{
		"title": "Nouveau langage Perl 6 : une expressivité sans précédent",
		"author": "Laurent Rosenfeld",
		"page": 6,
		"keywords": [
			"Perl 6",
			"Rakudo-Perl 6",
			"Langage multiparadigme",
			"Typage graduel",
			"Opérateurs de listes"
		],
		"description": "La première version officielle de production du langage de programmation Perl 6 est sortie fin décembre 2015. Perl 6 reste dans l'esprit de Perl, et sa syntaxe présente de fortes ressemblances avec les versions antérieures de Perl, mais c'est véritablement un nouveau langage, résolument moderne et d'une puissance expressive sans précédent.",
		"summary": "Perl 6 est un nouveau langage de programmation propre, moderne et multiparadigme : il offre des possibilités de programmation procédurale, orientée objet et fonctionnelle ; il ne vous impose aucun de ces modèles de programmation, c'est vous qui choisissez selon vos besoins spécifiques et vos préférences personnelles. Il propose aussi au choix typage statique fort ou un typage dynamique.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "H1iCrsNj"
	},
	{
		"title": "Code et maintenabilité",
		"author": "The Cheshire Cat",
		"page": 14,
		"keywords": [
			"Humeur",
			"Développeur",
			"Maintenabilité",
			"Equipe",
			"Code",
			"Bonne pratique"
		],
		"description": "Ecrire du code, c'est ce que nous faisons. Mais pensons-nous au futur quand nous l'écrivons ? Ne devrions-nous pas ? Qu'est ce qui fait que notre code sera ou ne sera pas maintenable et comment améliorer les choses ?",
		"summary": "Le but du code, ce n'est pas d'être écrit, le code en lui-même n'est pas une finalité. Le code est écrit pour que le programme qui le constitue fonctionne et ce programme doit fonctionner \"longtemps\". Qu'est ce que cela sous-entend pour nous, développeurs ? C'est ce dont nous allons commencer à parler ce mois-ci.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "SklsCHiVo"
	},
	{
		"title": "Peut on vraiment calculer avec un ordinateur ?",
		"author": "Florent Langrognet",
		"page": 16,
		"keywords": [
			"Calcul",
			"Réels",
			"Flottants",
			"Précision",
			"Arithmétique",
			"Norme"
		],
		"description": "Alors que le recours à l'ordinateur pour calculer toujours plus vite, modéliser toujours plus finement est inscrit dans une logique de progrès, il paraît indispensable de comprendre comment sont effectués ces calculs pour garder un regard critique sur la qualité des résultats qui ne sont qu'une approximation (plus ou moins bonne) des vraies valeurs. Comment sont stockés les réels, comment sont effectués les calculs, d'où viennent les erreurs de précision, peut-on les contenir ? Vous l'apprendrez en lisant cet article et sa suite.",
		"summary": "Dans cette première partie, nous commencerons par donner quelques exemples afin de montrer que les erreurs de calcul arrivent très vite et peuvent, dans certains cas, donner des résultats totalement faux. Nous expliquerons ensuite comment sont stockés les réels dans les ordinateurs et montrerons ainsi que ces nombres réels (les flottants) ne représentent qu'un sous-ensemble des vrais réels.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "S1-iCHoVi"
	},
	{
		"title": "Expliquer un code QR",
		"author": "Nicolas Patrois",
		"page": 22,
		"keywords": [
			"Python",
			"Code QR",
			"Programmation orientée objet"
		],
		"description": "Vous en avez assez de voir des codes QR sans comprendre leur fonctionnement ? Voici comment lire leur contenu, qu'il soit entaché d'erreurs ou non et comment en créer.",
		"summary": "Cette série de huit articles présente une étude presque complète des codes QR et pour commencer, une présentation du projet suivie d'une description du format et des premières méthodes de notre classe. Les deux articles suivants déchiffreront l'image en un tableau de bits puis en liront toutes les informations nécessaires à son décodage, c'est à dire écrire le message caché dans le magma de carrés noirs et blancs. Toutes les informations de format pourront également être affichées. Les codes QR entachés d'erreurs ou munis d'un petit dessin verront leur contenu corrigé à l'aide de codes de reed-Solomon (et un brève étude d'un corps fini ansi que son codage en Python seront nécessaires). Enfin, tout ceci nous servira pour créer un code QR fonctionnel.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "HJMo0HjEi"
	},
	{
		"title": "Déchiffrer un code QR",
		"author": "Nicolas Patrois",
		"page": 28,
		"keywords": [
			"Python",
			"Code QR",
			"Programmation orientée objet",
			"Algorithme",
			"Graphe",
			"Expression rationnelle"
		],
		"description": "Après les présentations de l'article précédent, on continue notre voyage en lisant l'image du code QR pour la traduire en un tableau de 0 et de 1.",
		"summary": "Dans cet article, on transformera l'image d'un code QR sans erreur ni joli petit dessin en un tableau de bits. Pour cela, on doit déterminer la taille d'un module, la position des cibles et éventuellement l'orientation de l'image.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "By7jRSoEs"
	},
	{
		"title": "Mettre en place un bureau virtuel sur son serveur dédié",
		"author": "Bruno Dubois",
		"page": 32,
		"keywords": [
			"Session HTTP",
			"Tomcat",
			"Stateless Web Tier",
			"Hava/J2EE"
		],
		"description": "Profitez des tarifs très abordables des serveurs dédiés Linux pour installer un serveur X et un bureau complet accessibles en permanence depuis votre tablette, votre laptop, le PC d'un ami ...",
		"summary": "De nos jours, il est de plus en plus facile de se passer d'un \"gros ordi\" chez soi. En effet, hormis quelques cas spécifiques (les jeux vidéo 3D, les applications de montage vidéo, etc.) qui nécessitent un maximum de puissance, les ordinateurs d'entrée de gamme en vente actuellement ont des spécifications techniques bien supérieures à ce dont nous avons besoin pour envoyer un email ou même faire un tableau croisé dynamique dans notre tableur favori. De plus, les nouveaux usages se sont déplacés progressivement sur le Cloud. C'est à dire que notre laptop se transforme petit à petit en un simple terminal qui permet d'accéder à nos données, et même à nos applications, qui sont, elles, sur le net. Ce qui nous amène à nous contenter d'une tablette, ou même d'un smartphone, pour gérer notre vie numérique, car un latptop aussi devient trop puissant pour notre besoin.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "SkVoRBiEo"
	},
	{
		"title": "Tomcat en version \"Stateless\"",
		"author": "Pierre-Emmanuel Gros",
		"page": 38,
		"keywords": [
			"Session HTTP",
			"Tomcat",
			"Stateless Web Tier",
			"Hava/J2EE"
		],
		"description": "Le but de cet article est de faire les modifications nécessaires afin de rendre Tomcat \"clusterisable\" en mode stateless pour des applications Java Rich Internet Application. Au menu de l'article, on ouvrira le ventre d'un serveur J2EE pour faire les modifications indispensables au processus de sauvegarde de session.",
		"summary": "L'application phare de notre société est écrite en Java et gère un nombre important d'utilisateurs. Chaque utilisateur étant représenté par une session assez grosse, l'aventure de cet article a débuté lorsque j'ai dû reconfigurer le serveur Tomcat qui se mettait à gérer plus de 300 Mio de session. Nous aborderons donc dans cet article la programmation d'un module Tomcat permettant d'optimiser la gestion mémoire des sessions.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "rkSjABi4o"
	},
	{
		"title": "Git init /etc",
		"author": "Cyrille Colin",
		"page": 46,
		"keywords": [
			"Etckeeper",
			"Versionning",
			"Git",
			"Etc",
			"Configuration",
			"Administration système",
			"Gitlab",
			"Tickets"
		],
		"description": "Quelques fichiers de configuration ont été modifiés, quels paquets ont été installés ? Nous allons voir comment, avec l'outil etckeeper, nous pouvons obtenir les réponses à ces questions.",
		"summary": "Conserver et consulter les modifications de configuration d'un serveur ? L'emploi des outils de gestion de version, comme git, permettent d'assister l'administrateur. Etckeeper permet lui d'adapter un système de gestion de versions à la sauvegarde d'un système de fichiers comme /etc. Couplé à un système de tickets il permet une traçabilité des actions, de visualiser les modifications apportées au système.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "BkUj0HiNo"
	},
	{
		"title": "Rédiger son article avec AsciiDoc",
		"author": "Benoit Benedetti",
		"page": 52,
		"keywords": [
			"Rédaction",
			"Asciidoctor",
			"LibreOffice",
			"Asciidoc"
		],
		"description": "Si vous rédigez des articles pour GNU/Linux Magazine Grance, vous en avez peut-être assez d'utiliser OpenOffice/LibreOffice et de passer plus de temps à vous battre avec l'éditeur pour ajouter des styles à votre article, plutôt que dans la rédaction propre de l'article. Je vous propose de découvrir un thème asciidoctor que j'ai créé et qui va vous permettre de rédiger dans votre éditeur de texte préféré votre article au format asciidoc, pour le générer au format ODT attendu par l'équipe de rédaction du magazine. Et même si vous n'avez jamais écrit d'article, peut être que cet article vous mettra le pied à l'étrier, ou plus simplement vous donnera des idées pour utiliser asciidoc pour créer votre thème personnalisé asciidoctor pour générer vos propres documents.",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "ryDs0rjNo"
	},
	{
		"title": "Ecrire sont thème Asciidoctor",
		"author": "Benoit Benedetti",
		"page": 56,
		"keywords": [
			"Rédaction",
			"Asciidoctor",
			"GLMF",
			"Slim",
			"(F)ODT",
			"Asciidoc"
		],
		"description": "Vous avez testé la recette précédente pour générer un article à partir d'un fichier source Asciidoctor et vous aimeriez savoir comment écrire votre propre thème Asciidoctor pour générer vos documents personnalisés.",
		"summary": "Asciidoctor possède un framework de création de thèmes pour générer vos documents personnalisés que nous allons découvrir.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "HkuiAHiVo"
	},
	{
		"title": "Il en lui manque que la parole...",
		"author": "Tristant Colombo",
		"page": 64,
		"keywords": [
			"Synthèse vocale",
			"Espeak",
			"SVOX Pico TTS",
			"Google TTS",
			"GNUSpeech",
			"Web Speech",
			"ResponsiveVoiceJS"
		],
		"description": "Nous avons tous déjà entendu cette phrase généralement prononcée par une personne âgée en flattant un chient : \"il ne lui manque que la parole !\". Mais c'est un chien... déjà que son maître parle, on ne va pas en plus devoir entendre l'animal ! Et un ordinateur, ça peut parler ?",
		"summary": "Les solutions de synthèse vocale sont nombreuses sur le marché, qu'il s'agisse de solutions open source ou proprétaires. Pour pouvoir effectuer un choix il faut les tester ! C'est ce qui est fait dans cet article avec le test de six outils qui pourront être utilisés simplement dans vos programmes.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "BkYj0rs4i"
	},
	{
		"title": "Le graal à portée de main : écrire un interpreteur",
		"author": "Guillaume Saupin",
		"page": 72,
		"keywords": [
			"C++",
			"Lisp",
			"LLVM",
			"Compilation",
			"Parseur",
			"Langage"
		],
		"description": "Dans le précédent article, notre héros, le Lisp, a fait l'objet d'un rappel de ses innombrables qualités. Inspirés par ce modèle, nous avons présentés rapideent le caractère modulaire que nous souhaitions donner à notre langage, puis décrit la structure de données contenant le code parsé, et enfin écrit un parseur récursif descendant. Tout ça n'est pas très utile. nous allons remédier à ça en ajoutant un interpréteur à notre langage;",
		"summary": "Dans ce second article, nous allons donner vie à notre langage en lui offrant un interpréteur et un premier ensemble de fonctions arithmétiques tout en revenant en détail sur la gestion de nos modules.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "rJ9s0SiVs"
	},
	{
		"title": "Android Context : quel context utiliser dans votre application Android ?",
		"author": "Ramel Adjibi",
		"page": 78,
		"keywords": [
			"Android",
			"Java",
			"Android Studio",
			"Context",
			"Activity",
			"View"
		],
		"description": "Lors du développement d'une application mobile Android, on est souvent confronté au choix du Context afin d'initialiser tel ou tel composant ; cela peut être une vue, un adapter etc. Il existe plusieurs Context mis à notre disposition par le framework Android ; essayons de voir ensemble quel Context utiliser suivant la situation dans laquelle on pourrait se retrouver :-)",
		"summary": "Optimiser son code pour éviter au maximum les fuites de mémoire est l'un des objectifs d'un bon développeur. Pour ce faire, plusieurs points sont à prendre en compte, comme le choix du Context à utiliser dans une situation donnée. Nous verrons ensemble dans la suite de l'article quels sont les Context mis à notre disposition et comment s'en servir à bon escient.\n",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai 2016",
		"number": 193,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/937-gnulinux-magazine-193.html",
		"type": "glmf",
		"id": "BksjRBsVi"
	},
	{
		"title": "Le langage Perl 6, poursuite du tour d'horizon",
		"author": "Laurent Rosenfeld",
		"page": 6,
		"keywords": [
			"conditions",
			"boucles",
			"fonctions",
			"fonctions multiples",
			"opérateurs",
			"programmation fonctionnelle"
		],
		"description": "Nous poursuivons ici le tour d'horizon du nouveau langage Perl 6 en abordant les structures de contrôles, les fonctions et la construction de nouveaux opérateurs.",
		"summary": "Dans le premier volet de ce tour d'horizon du nouveau langage de programmation Perl 6, nous avons notamment présenté les différents types de variables et les principaux opératuers du langage. Le présent article décrit notamment les principales structures de contrôle : les conditions (if, unless, given ... when) et les boucles (for, while, until, loop). Il montre ensuite comment créer des fonctions dotées de signatures fortement ou faiblement typées, au choix de l'utilisateur ; on verra notamment comment des signatures différentes permettent d'écrire des fonctions (fonctions dites multiples) ayant le même nom, mais faisant des choses différentes selon le nombre et le type de leurs arguments. Nous verrons enfin combien il est facile de créer dynamiquement de nouveaux opérateurs permettant d'étendre le langage.\n",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "rknj0BjNj"
	},
	{
		"title": "PostgreSQL 9.5 : Les nouvelles fonctionnalités SQL",
		"author": "Guillaume Lelarge",
		"page": 14,
		"keywords": [
			"PostgreSQL",
			"Nouveautés",
			"Standard SQL",
			"Fonctions OLAP",
			"Sharding"
		],
		"description": "La version 9.5 de PostgreSQL apporte de nombreuses nouveautés. COmme il serait difficile de tout énumérer en un seul article, nous allons aborder ici certaines fonctionnalités relatives au SQL et aux utilisateurs finaux de PostgreSQL. Un gros travail a été effectué par les développeurs pour permettre de gérer de plus gros vbolumes de données, et cela se voit dans les fonctionnalités que nous allons décrire maintenant.",
		"summary": "PostgreSQL est un moteur de bases de données évoluant constamment. Avec une nouvelle version majeure chaque année, il est souvent difficile de suivre les améliorations apportées. Cet article a pour but de détailler quelques fonctionnalités importantes au niveau SQL proposées par la version 9.5. Il cible principalement les développeurs qui travaillent avec PostgreSQL, mais aussi les utilisateurs et les administrateurs.\n",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "SyTsAHj4s"
	},
	{
		"title": "Je suis pas analyste !",
		"author": "Jean-Pierre Troll",
		"page": 18,
		"keywords": [
			"Humeur",
			"Jean-Pierre Troll",
			"Coup de gueule",
			"Analyste"
		],
		"description": "J'ai plus d'abonnements au Gartner, Forrester et autres cabinets d'analystes. Enfin, ma boîte me donne plus les accès à cette si substantifique moelle de réflexion, d'analyse, de synthèse, de futurologie ! Ça tombe bien, car ça commençait à fortement me soûler toute cette logorrhée marketing reprise la bouche en coeur par mes collègues, mes managers, mes clients, ma copine, mon chat... (je n'ose ni n'arrive à mettre d'ordre dans cette liste !)",
		"summary": "Le retour de la revanche de Jean-Pierre Troll. Après une mise au vert, la démangeaison du coup de gueule me reprend. Un peu comme un éternuement que j'essayais de contenir... Pour ce retour, je propose une analyse alternative de la transformation digitale. Plutôt que les technologies, je propose de se concentrer sur les usages. Et la convergence et l'interrelation de quatre changements de paradigmes majeurs dans les usages donnent ce que je baptse le \"Plexus\" : hyperconnexion, consumérisation, commoditisation et intermédiation. Ok, \"Beam me Mr Spock !\".\n",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "HJCjCHjEs"
	},
	{
		"title": "Peut-on vraiment calculer avec un ordinateur : les opérations",
		"author": "Florent Langrognet",
		"page": 22,
		"keywords": [
			"Calcul",
			"Réels",
			"Flottants",
			"Précision",
			"Arithmétique",
			"Norme"
		],
		"description": "Nous avons vu le mois dernier comment étaient représentés les réelsz sur ordinateur. Il est temps maintenant d'utiliser ces réels (les flottants) pour calculer. Quels sont les mécanismes mis en oeuvre lors de chaque opération ? A quelle(s) étape(s) des erreurs de précision peuvent-elles apparaître ? L'ordre des calculs a-t-il une importance sur la qualité des résultats ? Vous trouverez les réponses à toutes ces questions (et bien d'autres) dans les pages de cet article.",
		"summary": "Après avoir expliqué comment les réels étaient représentés sur ordinateur, nous allons montrer dans les détails comment se déroulent deux opérations (l'addition et la soustraction). Ainsi, nous verrons les causes des erreurs de précision et quelles sont les pistes pour les contenir. Nous regarderons ensuite ce qui se passe avec les autres opérations et conlurons.\n",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "BJJeoAro4s"
	},
	{
		"title": "Décoder un code QR",
		"author": "Nicolas Patrois",
		"page": 32,
		"keywords": [
			"Python",
			"Code QR",
			"Programmation orientée objet",
			"Algorithme"
		],
		"description": "Une fois que l'on sait déchiffrer un code QR, il faut le décoder... et il y a encore du travail avant de pouvoir lire son contenu.",
		"summary": "Nous allons décortiquer le code QR petit à petit pour en extraire les informations utiles à la lecture de son contenu. Le code et les fichiers utiles sont sur Github.\n",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "BklloCBsNs"
	},
	{
		"title": "Chiffrer une partition avec LVM et LUKS",
		"author": "Tristant Colombo",
		"page": 42,
		"keywords": [
			"Chiffrement",
			"LVM",
			"Debian",
			"Partition",
			"LUKS"
		],
		"description": "Un nouvel ordinateur portable ? Il est essentiel de chiffrer votre disque ! Pour cela, nous allons utiliser un conteneur LVM (Logiciel Volume Manager) pour les données et les chiffrer avec un conteneur LUKS (Linux Unified Key Setup)",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "r1WxjCHoVi"
	},
	{
		"title": "Gestion de paquets sûre et flexible avec GNU Guix",
		"author": "Ludovic Courtès",
		"page": 46,
		"keywords": [
			"Gestion de paquets",
			"Distribution",
			"Programmation fonctionnelle",
			"GNU"
		],
		"description": "Les distributions GNU/Linux classiques sont mal aimées. Cet article revient sur leurs limites et donne un aperçu de la solution que propose le projet GNU avec Guix, un gestionnaire de paquets transactionnel, flexible et personnalisable.",
		"summary": "Linux Weekly News dénombre plus de 500 distributions GNU/Linux et y voit une \"célébration de la diversité\". Avec ça, le problème de la distribution de logiciels a été largement exploré, et probablement largement résolu, se dit-on. Et pourtant ! Cet article traite d'un nouveau gestionnaire de paquets, GNU Guix, qui fournit mises à jour transactionnelles, retours en arrière, et ext extensible et personnalisable à souhait.\n",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "HyfejAHjEi"
	},
	{
		"title": "Déconnexion PDO : du comptage de références en PHP",
		"author": "Gabriel Zerbib",
		"page": 52,
		"keywords": [
			"PHP",
			"Référence counting",
			"PDO",
			"Closures"
		],
		"description": "Vous utilisez pour votre projet les composants populaires et éprouvés de l'écosystème PHP et mettez en oeuvre les pratiques recommandées dans les manuels. Pourtant votre application se heurte à des problèmes de conception : une piste se cache peut-être ici.",
		"summary": "PHP, comme la plupart des langages dynamiques, offre un mécanisme de collecte de résidus qui affranchit le développeur de se préoccuper de la gestion de la mémoire. Il est notre ami, mais il est préférable de savoir travailler avec lui pour éviter certains désagréments liés à la structure du langage.\n",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "SkXlsRro4s"
	},
	{
		"title": "Programmer avec GTK+",
		"author": "Christophe Borelly",
		"page": 58,
		"keywords": [
			"GTK+",
			"Langage C",
			"applications graphiques",
			"Evénements",
			"Styles",
			"Internationalisation"
		],
		"description": "Cet article va vous présenter les rudiments de la programmation d'applications graphiques en C à l'aide de la boîte à outils GTK+ (GIMP Toolkit).",
		"summary": "Dans cet article, vous apprendrez à développer une petite application en C permettant de simuler un système d'authentification utilisateur. Vous découvrirez comment organisez les éléments graphiques dans la fenêtre, comment gérer les événements utilisateur (comme le clic sur un bouton), comment paramétrer le style des éléments avec du CSS (Cascading Style Sheet) comme en HTML, et enfin comment internationaliser l'application (c'est à dire afficher les textes en fonction de la langue utilisée).\n",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "BJ4ljRBjVi"
	},
	{
		"title": "Un vrai language",
		"author": "Guillaume Saupin",
		"page": 66,
		"keywords": [
			"C++",
			"Lisp",
			"LLVM",
			"Compilation",
			"Parseur",
			"Langage"
		],
		"description": "Les deux précédents articles de cette série nous ont permis de mettre au point les fonctionnalités de base de notre langage de programmation. Nous sommes maintenant outillés pour pouvoir parser et évaluer des expressions d'un langage de type Lisp. De plus, nous disposons d'un mécanisme de plugins permettant d'étendre facilement notre langage. Nous allons maintenant passer aux choses sérieuses et permettre à notre langage de s'étendre en déclarant des fonctions et surtout en supportant les macros.",
		"summary": "Dans ce troisième article, nous allons étendre très largement les possibilités de notre langage, en ajoutant non seulement les fonctions, mais aussi les macros. Pour cela, nous commencerons par ajouter quelques structures pour le contrôle de flux, comme l'indispensable if. Nous détaillerons ensuite la forme spéciale let, qui permet d'ajouter des variables. Il apparaîtra ensuite que l'ajout de fonctions est finalement proche de cette forme. Enfin, nous irons au delà de ce que sont capables de faire la plupart des langages en dotant notre langage de macros.\n",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "HJSxoRroVj"
	},
	{
		"title": "(Re)découvrons jQuery",
		"author": "Laurent Navarro",
		"page": 74,
		"keywords": [
			"jQUery",
			"HTML",
			"CSS",
			"Javascript",
			"Web",
			"Programmation"
		],
		"description": "jQuery est une bibliothèque connue de tous ceux qui développent sur le Web, parfois juste de nom, parfois juste parce qu'ils ont copié/collé quelques lignes magiques, je vous invite aujourd'hui à l'étudier d'un peu plus près.",
		"summary": "L'objectif de cet article est de reprendre les bases de jQuery afin de formaliser un peu son utilisation et d'essayer d'aller un peu plus loin que les utilisations ultra-basiques.\n",
		"date": "2016-06-01T00:00:00.000Z",
		"displayed_date": "Juin 2016",
		"number": 194,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "glmf",
		"id": "HJ8xjABiVo"
	},
	{
		"title": "PostgreSQL 9.5 : Encore des nouveautés",
		"author": "Guillaume Lelarge",
		"page": 6,
		"keywords": [
			"PostgreSQL",
			"Nouveautés",
			"Maintenance",
			"SQL",
			"Configuration"
		],
		"description": "On continue notre tour des nouveautés au niveau SQL de la version 9.5. Mais nous allons aussi détailler quelques fonctionnalités intéressantes principalement les DBA, avec quelques nouveautés sur la maintenance et la configuration.",
		"summary": "PostgreSQL est un moteur de bases de données évoluant constamment. Avec une nouvelle version majeure chaque année, il est souvent difficile de suivre les améliorations apportées. Cet article a pour but de détailler quelques fonctionnalitées importantes proposées par la version 9.5 pour les DBA.\n",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "rJwxo0rjNi"
	},
	{
		"title": "Les réseaux Asociaux",
		"author": "Jean-Pierre Troll",
		"page": 12,
		"keywords": [
			"humeur",
			"Jean-Pierre Troll",
			"Coup de gueule",
			"Réseaux sociaux"
		],
		"description": "Hum... Autant le dire direct: c'est de la m... J'aime pas ! Traitez-moi de reac' si vous voulez, mais surtout, faites-le bien sur votre plateforme sociale préférée (pfff...), vous ne ferez rien d'autre que prouver mon point.",
		"summary": "Je développe ma description de ce que j'ai baptisé le Plexus dans mon précédent article... Sur ce coup de gueule, je précise ce qui m'énerve dans les réseaux que je qualifie d'asociaux : l'hyperconnexion et l'hyperconsommation nourissent en effet miroir par l'hyporéflexion des hyponautes que nous devenons. J'espère qu'avec un tel résumé vous êtes déjà sonnés, motivés ou que vous avez passé votre chemin (genre \"pfff, Jean-Pierre a encore pété un câble et en plus maintenant il invente des mots !\")\n",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "HJdgjRSoEo"
	},
	{
		"title": "Expliquer un corps fini",
		"author": "Nicolas Patrois",
		"page": 16,
		"keywords": [
			"Python",
			"Corps finis",
			"Programmation orientée objet",
			"Algorithme"
		],
		"description": "Pour corriger un code QR avec erreur ou rature, on a besoin de savoir manipuler un corps fini précis, F256, encore faut il savoir de quoi on parle.",
		"summary": "En vue de corriger les codes QR décorés ou abîmés, on a besoin de notions mathématiques plus poussées. Cet article va présenter la notion mathématique de corps fini, sur laquelle le code correcteur Reed-Solomon est construit. On construira en Python le coprs Z/pZ où p est un nombre premier. Les codes sont disponibles sur Github.\n",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "ryFeo0BiVi"
	},
	{
		"title": "Bienvenue dans le monde des descripteurs de fichiers",
		"author": "Sami ben Youssef",
		"page": 20,
		"keywords": [
			"Descripteurs de fichiers",
			"Table des fichiers ouverts",
			"Appels systèmes",
			"Fonctions de bibliothèques",
			"Zone u"
		],
		"description": "Les descripteurs de fichiers vous disent-ils quelque chose ? Pourtant ils sont présents dans les processus que vous lancez, se sont les clés de manipulations de vos fichiers, vos sockets, vos pipes...etc. Je vous invite alors à découvrir le petit monde de ces puissantes variables de type entier qui se loge, sans permission, dans vos processus dès leur création.",
		"summary": "NOus présenterons les descripteurs de fichiers du point de vue emplacement et intéraction avec les éléments de l'univers où ils opèrent du côté développeur et du côté système moyennant les appels systèmes et les fonctions des bibliothèques. Par la suite, nous avons consacré une partie, orientée surtout vers la pratique, dans laquelle on a détaillé la manipulation et la visualisation des descripteurs de fichiers d'un processus dont on a créé le code.\n",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "ByqesCSjVi"
	},
	{
		"title": "Configurer à chaud votre serveur OpenLDAP",
		"author": "Antoine le Morvan",
		"page": 28,
		"keywords": [
			"Annuaire",
			"OLC",
			"TLS",
			"OpenLDAP",
			"Sécurisation"
		],
		"description": "Le serveur d'annuaire OPenLDAP a déjà fait l'objet de nombreux articles dans GLMF, expliquant son installation, sa prise en main, la mise en place d'index ou d'ACL. Concentrons-nous aujourd'hui sur la \"nouvelle\" façon de modifier la configuration du serveur OpenLDAP à chaud.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "SkiejASjVi"
	},
	{
		"title": "Démystification de l'attaque par buffer overflow",
		"author": "Stéphane Lonkeng Toulepi",
		"page": 35,
		"keywords": [
			"Buffer overflow",
			"attaque",
			"C",
			"Python",
			"GNU debugger",
			"gdb",
			"shellcode",
			"assembleur",
			"registre"
		],
		"description": "On entend beaucoup parler des buffer overflow (\"débordement de tampon\" en français). Il paraît que c'est un problème dans la programmation en C qui entraîne un crash lors de l'exécution et qui peut être utilisé par un hacker... Ok, ça tout le monde le sait :-|. On entend beaucoup parler de ça mais c'est quoi concrètement ? Comment peut-on réussir à prendre le contrôle d'une machine par un \"débordement de tampon\" ? Et apparamment ça se fait même à distance !",
		"summary": "Les attaques par buffer overflow nécessitent des connaissances en organisation mémoire et en programmation C. Pour illustrer tout ceci, nous allons commencer par prendre un code C simple vulnérable au buffer overflow ; nous allons ainsi analyser l'exécution du programme avec gdb qui nous permettra justement de comprendre le buffer overflow. Enfin, nous allons montrer comment utiliser le buffer overflow pour éxecuter un code arbitraire et dans le cas d'espèce, un shell.\n",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "HJ3xsABoVo"
	},
	{
		"title": "Filtrez vos courriels avec python",
		"author": "Cyril Roelandt",
		"page": 42,
		"keywords": [
			"Python",
			"Courriel",
			"IMAP",
			"Filtres",
			"imaplib"
		],
		"description": "Vous utilisez sans dout IMAP (Internet Message Access Protocol) pour lire votre courrier. N'avez vous jamais eu envie d'écrire un script utilisant ce protocole afin d'effectuer des opérations courantes (marquer un fil de discussion comme lu, le déplacer, etc.) automatiquement ? C'est possible grâce à Python et son module imaplib, qui fait partie de la bibliothèque standard.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "rkagoCSiEo"
	},
	{
		"title": "Apprenez à tenir vos promesses avec javascript",
		"author": "Stéphane Mourey",
		"page": 46,
		"keywords": [
			"Javascript",
			"Promesse",
			"Fonction de rappel",
			"Traitement asynchrone",
			"Prallélisme",
			"Méthodologie"
		],
		"description": "Passées dans le standard EcmaScript 6, les promesses sont un concept algorithmique bien utile pour la programmation d'applications asynchrones. Implémentées d'abord par certaines bibliothèques, elles bénéficient maintenant du support natif de Javascript.",
		"summary": "Les promesses sont un concept de programmation utilisé pour anticiper un résultat sans bloquer l'application en l'attendant. A ce titre, elles se révèlent particulièrement utiles dans le cadre d'une application web et permettent d'imaginer une méthodologie où le fonctionnement asynchrone dépasse celui des simples requêtes AJAX.\n",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "HJCxs0SsVi"
	},
	{
		"title": "Déstructurez vos documents: conversion latex vers libreoffice",
		"author": "Arnaud Février",
		"page": 50,
		"keywords": [
			"Latex",
			"Tex",
			"libreoffice",
			"ODT",
			"Traitement de texte",
			"format de fichier"
		],
		"description": "Nous sommes nombreux à savoir quel est le meilleur traitement de texte de la galaxie : le mien ! Quelques êtres faibles en utilisent d'autres par mégarde. Dans notre immense magnanimité, nous pouvons rédiger un document dans notre format favori et leur mettre à disposition dans leur format. Nous montrons dans cet article comment convertir un document latex en libreoffice. Il se pourrait que d'autres articles plus généraux suivent.",
		"summary": "Nous présentons dans cet article un des nombreux logiciels de conversions interformat pour les traitement de texte. Il s'agit du transformer un document, rédigé en LaTeX en un autre format. Nous présentons text4ht, qui converti les documents TeX ou LaTeX en un format html ou libreoffice. Nous montrons comment les formules mathématiques, une des spécialités de LaTeX sont transformées dans le format mathématique de LibreOffice. Enfin, nous présentons quelques éléments qui permettront d'affiner la transformation.\n",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "rJkWiAHoVo"
	},
	{
		"title": "Python : un environnement vraiment isolé avec GNU Guix",
		"author": "Cyril Roelandt",
		"page": 54,
		"keywords": [
			"Python",
			"Environnement isolé",
			"Virtualenv",
			"GNU Guix",
			"Gestion de paquets"
		],
		"description": "Peut-on créer facilement un environnement de tests complètement reproductible pour son application Python ? La solution est-elle vraiment Virtualenv ? Un gestionnaire de paquets fonctionnels ne ferait-il pas mieux l'affaire ?",
		"summary": "Virtualenv est un logiciel très populaire chez les développeurs Python : il leur permet de définir des environnements virtuels au sein desquels ils peuvent installer des paquets Python sans modifier l'état de leur système. Nous verrons dans cet article que cette approche présente quelques problèmes et montrerons comment les résoudre en utilisant GNU Guix.\n",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "BJgbs0BoVs"
	},
	{
		"title": "Réalisation d'un automatisme d'objets connectés sans cloud ni smartphone",
		"author": "Nicolas Gachadoit",
		"page": 58,
		"keywords": [
			"Objets connectés",
			"Bluetooth Low Energy",
			"BLE",
			"Automatisation",
			"Python",
			"iBeacon",
			"wifi"
		],
		"description": "Découvrer comment exploiter sur votre réseau local, avec des matériels et logiciels adaptés, des produits conçus pour l'IoT.",
		"summary": "Les objets connectés ouvrent une nouvelle voie aux programmeurs non bidouilleurs : il est désormais possible de réaliser soi-même des automatismes domotiques sans utiliser de fer à souder ni risque de s'électrocuter. Malheureusement, leurs fabricants, obnubilés par l'immense marché du Cloud et des Apps pour smartphone, ne rendent pas ces tâches immédiatement réalisables. L'objectif de cet article est de montrer qu'en utilisant Python avec des matériels et librairies adquates, on peut réaliser facilement un éclairage automatique personnalisé sur la base d'un SensorTag (objet multicapteurs communiquant en Bluetooth Low Energy), d'une balise iBeacon et d'une ampoule connectée en Wifi.\n",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "BJZWsAHj4s"
	},
	{
		"title": "Vision assistée par ordinateur via OpenCV",
		"author": "FLorent Thevenet",
		"page": 68,
		"keywords": [
			"OpenCV",
			"Traitement d'images",
			"Analyse d'images",
			"Vision assistée par ordinateur",
			"Java"
		],
		"description": "Comment reconnaître un objet sur une image ? Comment corriger la perspective d'une image ? Apprenez à utiliser les algorithmes d'OpenCV au travers d'exemples pour traiter et analyser des images.",
		"summary": "La vision par ordinateur combine deux aspects. Le traitement transforme l'image acquise pour améliorer sa qualité, dans le but de l'analyser par la suite pour en extraire les informations souhaitées. Ces deux phases sont traitées dans cet article avec la bibliothèque OpenCV qui permet une mise en oeuvre rapide des mécaniques de vision numérique.\n",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 195,
		"url": "https://boutique.ed-diamond.com/gnulinux-magazine/1059-gnulinux-magazine-195.html",
		"type": "glmf",
		"id": "rkMWsABsEi"
	},
	{
		"title": "Intégration de modélisation 3D dans une photo et caméra mapping avec Blender et BLAM",
		"author": "Anthony Carré",
		"page": 10,
		"description": "Vous souhaitez intégrer une modélisation 3D dans une prise de vue réelle. Pour cela, vous utiliserez certainement Blender, la référence libre pour l'animation 3D. Pour que votre intégration soit réussie, vous devrez commencer par une étape relativement laborieuse, mais toutefois obligatoire : ajuster les paramètres de la caméra virtuelle pour la faire coïncider avec la caméra que vous avez utilisée pour filmer votre prise de vue. Etape laborieuse ? Non ! BLAM est là pour vous simplifier la tâche.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "rkQWoASsNs"
	},
	{
		"title": "Réparez les objets du quotidien avec la 3D",
		"author": "Hervé Massicot",
		"page": 18,
		"description": "Je ne sais pas vous, mais j'accumule une quantité de petites choses à réparer à la maison. Entre les jouets de mes enfants, les petits bidules et autres machins, j'adopte quand je peux le système D. Colle, scotch, bricolage en tout genre... Ces réparations d'infortune sont la plupart du temps frustrantes, car elles ne réussissent pas toujours. Cela tient certainement à mon niveau de bricolage, mais pas que... En effet, il est parfois tout bonnement impossible d'effectuer la réparation, ceci de par la nature de l'objet ou de la pièce, mais parfois pire, il est impossible de trouver ou commander le morceau qu'il vous faut remplacer. Et quand cela l'est, c'est en général toute une partie qu'on vous vend à un prix tellement honteux que cela vous incite à renouveler votre appareil/objet. Or, depuis l'avènement de l'impression 3D pour le grand public, je me dis qu'il doit être possible de remédier à ce problème. Je me suis donc mis en tête de devenir un bricoleur 2.0.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "HJVbiRSiNi"
	},
	{
		"title": "Réaliser ses gravures laser à l'aide d'Inkscape",
		"author": "Yann Morère",
		"page": 24,
		"description": "Dans le précédent Linux Pratique, je vous ai rapidement présenté les nouveautés d'Inkscape 0.91. J'ai volontairement passé sous silence une nouvelle extension : Gcodetools. Elle permet de générer, à partir de vos compositions Inkscape, des fichiers G-code pour piloter des machines à commande numérique industrielles. Nous l'utiliserons ici pour réaliser de la gravure à l'aide d'une petite découpeuse/graveuse laser.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "H1rZsRBi4j"
	},
	{
		"title": "Monitoring réseau simple et rapide avec LibreNMS",
		"author": "Benoît Benedetti",
		"page": 32,
		"description": "Vous avez peut-être déjà essayé d'utiliser votre Nagios pour générer des graphiques et cartes de votre réseau. Déçu, vous vous êtes tourné vers une solution dédiée au monitoring réseau tel le fidèle Cacti, mais ses modèles par défaut ne vous ont pas donné satisfaction, vous vous êtes perdu dans sa configuration et son interface vieillissante a fini de vous faire fuir. Las, vous vous êtes tourné vers la version communautaire d'Observium, à la merci de ses développeurs. Dans cet article, nous allons voir comment vous tirer de là avec LibreNMS.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "SJU-j0SjVs"
	},
	{
		"title": "La vie privée en Europe : des législations nationales à une question globale",
		"author": "Tris Acatrinei",
		"page": 40,
		"description": "Nous abordons très régulièrement la question de la vie privée dans ce magazine. Dans l'avant dernier numéro de Linux Pratique, nous étions revenus sur la notion de vie privée en France. Aujourd'hui, nous passons à l'échelon supérieur pour comment nos voisins européens s'en sortent.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "BkP-jRSsEj"
	},
	{
		"title": "Clipperz : l'open source comme modèle de sécurité ?",
		"author": "Stéphane Mourey",
		"page": 46,
		"description": "Clipperz se présente comme un service en ligne vous permettant de stocker anonymement vos mots de passe et autres données cryptées de telle façon à ce que même le prestataire ne puisse les connaître. Pratique, sécurisé, et open source : que demander de plus ?",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "ryd-j0Ss4o"
	},
	{
		"title": "Chiffrez vos serveurs web",
		"author": "Arnaud Février",
		"page": 52,
		"description": "L'actualité parle beaucoup de sécurité des sites Internet. Les mentions de sites craqués sur lesquels les facétieux ou malfaisants ont changté le message d'origine sont légions. Pour se protéger de telles attaques, il faut sécuriser le système d'exploitation et les logiciels de création de sites. Mais même si le serveur légitime n'a pas été craqué, il est possible pour un attaquant d'usurper l'adresse du site et donc de fournir de fausses informations ou de capturer les données de la transaction. Nous allons montrer comment sécuriser la communication entre le navigateur et le serveur.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "rytZiRroEi"
	},
	{
		"title": "Colorisez vos textes avec la commande HL",
		"author": "Martial Bornet",
		"page": 60,
		"description": "L'objectif de cet article est de vous donner les moyens de mettre en évidence très simplement des fragments de texte en les colorisant avec la commande hl (disponible sur Github), après les avoir spécifiés au moyen d'expressions régulières. Les configurations disponibles dans les fichiers de configuration vous permettront d'utiliser cette commande directement pour des besoins courants, mais quelques rappels sur les expressions régulières vous aideront à développer vos propres configurations, vous permettant par exemple de coloriser facilement vos fichiers de logs ou résultats de commandes.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "HyqWoRBj4i"
	},
	{
		"title": "Enchérissez automatiquement avec eSniper",
		"author": "Vincent Magnin",
		"page": 70,
		"description": "Pour remporter des enchères eBay, inutile de vous connecter cinq minutes avant la fin pour surveiller ce qui se passe ! Le logiciel esniper peut surveiller autant d'objets que vous le souhaitez et enchérir au bon moment.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "r1oWsRBjNi"
	},
	{
		"title": "F-Droid, le dépôt d'applications libres pour Android",
		"author": "Arnaud Février",
		"page": 74,
		"description": "L'intérêt majeur des ordinateurs et autres ordiphones est la possibilité d'installer des applications, des sources de données ou des fichiers multimédias facilement. GOogle propose pour Android un store pour télécharger ces éléments. Le contrôle appliqué sur les données du store n'est souvent pas satisfaisant : certaines applications ne peuvent être considérées comme fiables et d'autres sont censurées sans décision judiciaire. C'est à l'utilisateur de décider si une application est fiable. Ceci est difficile, c'est pourquoi le projet F-Droid a vu le jour pour proposer en téléchargement des applications sécurisées et respectueuses de la vie privée.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "Synbs0BsEo"
	},
	{
		"title": "Un Kanban libre ? Yes, Wekan !",
		"author": "Benoît Benedetti",
		"page": 78,
		"description": "Kanban est une méthode popularisée dans les années 50 par Toyota pour optimiser les tâches à réaliser dans les chaînes de montage. Cette méthode s'est répandue jusque dans l'ingénierie logicielle, et plusieurs applications web on vu le jour pour mettre en place votre panneau Kanban pour votre projet. La plus connue de ces applications en ligne est Trello, payante et propriétaire, qui compte désormais des millions d'utilisateurs, pour des projets variés qui vont du développement logiciel au planning d'un voyage, en passant par le carnet de recettes de cuisine. Dans cet article, nous allons découvrir Wekan, un clone libre de Trello, que vous pourrez héberger sur votre propre serveur.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "BJ6-s0ro4j"
	},
	{
		"title": "Jekyll-DB : une base de données statique en HTML ?",
		"author": "Stéphane Mourey",
		"page": 82,
		"description": "Nous avons déjà parlé de Jekyll, le générateur de sites statiques devenu très populaire, notamment du fait de son intégration dans Github. Mais ce que nous n'avons pas encore dit, c'est qu'il est possible de l'utiliser astucieusement comme une base de données simple avec une interface web de consultation : découvrez Jekyll-DB.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "HkCWoCHsNj"
	},
	{
		"title": "Crème CRM, apprenez à utiliser le plus sucré des CRM",
		"author": "Jean-Michel Armand",
		"page": 91,
		"description": "Mettre en place des échanges est au coeur des activités des personnes morales. Cela peut être des échanges commerciaux, entre un client et son fournisseur ou des échanges non commerciaux comme entre une association et ses donateurs. La première étape d'un échange est donc de trouver avec qui le mettre en place. Trouver son futur client ou son prochain donateur. Le CRM est l'outil parfait pour faire cela.",
		"date": "2016-01-01T00:00:00.000Z",
		"displayed_date": "Janvier/Février 2016",
		"number": 93,
		"url": "https://boutique.ed-diamond.com/linux-pratique/920-linux-pratique-93.html",
		"type": "lp",
		"id": "ryJfjCSiEs"
	},
	{
		"title": "Conception 3D d'une clé USB avec FreeCAD",
		"author": "Laurent Delmas",
		"page": 8,
		"keywords": [
			"blender",
			"FreeCAD",
			"3D"
		],
		"description": "Vous connaissez tous Blender, le logiciel libre de modélisation 3D, mais probablement pas FreeCAD. Ce dernier est un logiciel de conception paramétrique comme les logiciels professionnels tels que SolidWorks ou Catia. FreeCAD permet entre autres la conception et la mise en plan de pièces 3D. Sa modularité lui permet d'étendre ses possibilités au Raytracing, à l'impression 3D en passant par l'assemblage complet de mécanismes et la simulation par calculs.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "SJxGoCSjVi"
	},
	{
		"title": "Monter son serveur de mails : Partie 1",
		"author": "Cédric Pellerin",
		"page": 16,
		"keywords": [
			"postfix",
			"smtp"
		],
		"description": "Comment monter à la main un serveur mail complet dans le but de comprendre ce que l'on fait et de maîtriser son installation de A à Z ?",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "BkZGiRSiNo"
	},
	{
		"title": "Les paradis numériques existent-ils ?",
		"author": "Tric Acatrinei",
		"page": 26,
		"description": "Depuis la promulgation de la loi HADOPI 2, puis de la LOPPSI et d'autres textes comme la loi sur le renseignement, la question de savoir où est-ce que les internautes peuvent encore préserver un minimum d'intimité numérique surgit et avec elle, celle des paradis numériques.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "HyzGiAHsVs"
	},
	{
		"title": "Let's Encrypt : le chiffrement gratuit, ouvert et automatisé sur internet",
		"author": "Christophe Brocas",
		"page": 30,
		"description": "Dans le numéro 91 de Linux Pratique, nous avons décrit comment mettre en oeuvre de manière sécurisée l'accès via TLS à votre site web. Mais la relative complexité de la procédure ou le coût d'achat des certificats numériques pouvait compliquer cette mise en oeuvre. Une initiative a été lancée par Mozilla, l'EFF et d'autres partenaires pour s'attaquer à ces difficultés : Let's Encrypt.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "BkmzsRSo4o"
	},
	{
		"title": "Ne vous faitesz plus pister sur le web avec Privoxy !",
		"author": "Stéphane Mourey",
		"page": 38,
		"description": "Surfez sur le Web est une expérience où il est difficile de garder le contrôle : de multiples techniques sont mises en oeuvre pour vous traquer. Le moindre mal, car le plus visible, est de vous \"offrir\" des publicités ciblées et envahissantes qui vous suivent d'un site à l'autre. Avec Privoxy, offrez vous un peu plus d'intimité et de confort.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "H1EGjCBiVi"
	},
	{
		"title": "Apprendre à manipuler le PDF en 10 cas pratiques",
		"author": "Hervé Massicot",
		"page": 52,
		"description": "Le format PDF est un format de fichier aujourd'hui largement répandu, car son gros avantage est de conserver la mise en forme du document (police, images, etc.) ceci peu importe la machine (PC, smartphone, liseuse...) ou le système d'exploitation. Mais ce gros avantage peut devenir contraignant. En effet, nous ne disposons pas tous de la suite logicielle Adobe permettant facilement de manipuler nos fichiers PDF. Avez vous déjà pesté face à votre écran, car il fallait modifier le fichier d'origine et régénérer un fichier PDF ? Il existe de nombreuses solutions à nos soucis du quotidien. Nous allons dresser dans ce dossier une liste des problématiques fréquentes et donner le moyen d'y remédier.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "rkHGsABiNj"
	},
	{
		"title": "Nettoyage des vieux noyaux GNU/Linux obsolètes",
		"author": "Thierry Gayet",
		"page": 58,
		"description": "Il arrive parfois que notre distribution favorite possède une collection de vieux noyaux GNU/Linux dus aux différentes mises à jour successives. Pour ce faire, je propose d'étudier une solution permettant de purifier un peu tout cela et par la même occasion de libérer de la place.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "rJLfo0BiVs"
	},
	{
		"title": "Gérez votre site Wordpress où que vous soyez",
		"page": 64,
		"description": "Bonne nouvelle pour les utilisateurs du célèbre CMS, Wordpress met à disposition de ces derniers une application Android et iOS leur permettant de gérer leur site directement depuis leur mobile. Même si celà ne vaut évidemment pas le confort du travail d'un PC, l'application en question en fera un excellent outil d'appoint pour intervenir sur son site où que l'on se trouve. On s'intéressera évidemment ici à l'application développée pour la plateforme Android.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "SywzsASiEs"
	},
	{
		"title": "Piwigo : votre galerie photo personnelle en ligne",
		"author": "Yann Morère",
		"page": 68,
		"description": "Vous prenez constamment des photos avec votre smartphone. Si vous souhaitez les partager et les organiser en ligne, elles peuvent ensuite automatiquement téléversées dans l'application Photos sur les serveurs de Google via votre compte \"Android\". Vous donnez ainsi accès à vos informations personnelles à une grande multinationale. Pourquoi ne pas reprendre le contrôle de vos données et gérer vous-même vos photos en ligne à l'aide de Piwigo ?",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "H1OGjCSoEo"
	},
	{
		"title": "Dopez vos CSS avec SASS",
		"author": "Stéphane Mourey",
		"page": 74,
		"description": "Les CSS constituent un outil remarquable qui permettent de gérer facilement le style de toutes les pages d'un site en seulement quelques fichiers. Ils permettent une factorisation en permettant de combiner à l'infini des règles de style pouvant s'appliquer à de multiples éléments. A l'infini ? Oui, et on en arrive bientôt à des dizaines de fichiers de milliers de lignes... D'où la naissance des langages de génération de CSS qui permettent de leur donner une couche d'abstraction supplémentaire et de mettre à jour bien plus facilement le style d'un site.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "H1YfoCHsVs"
	},
	{
		"title": "Un CRM, mais en fait, à quoi ça sert ?",
		"author": "Jean-Micherl Armand",
		"page": 80,
		"description": "Certains d'entre vous ont peut-être décidé de tenter la grande aventure de la création d'entreprise ou du freelance. Vous êtes peut-être déjà en plein dedans ou c'est un projet que vous espérez pouvoir bientôt réaliser. Dans tous les cas, pour espérer pouvoir faire vivre votre activité, vous allez devoir trouver des clients. Le CRM est l'outil qui peut vous aider à organiser et à optimiser cela. Nous allons voir dans cet article ce qui se cache vraiment derrière cet acronyme.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "S1qGo0BsNo"
	},
	{
		"title": "Communiquz librement avec Mattermost",
		"author": "Benoît Benedetti",
		"page": 84,
		"description": "Mattermost est un outil de communication collaborative, clone libre de Slack. Slack, cet outil sorti il y a moins d'un an, qui a très vite été adopté, car il facilite la communication d'entreprise, dont la start-up qui est estimée désormais à plus d'un milliard de dollars. Mattermost réunit donc le meilleur des deux mondes : les fonctionnalités de slack, et un code source libre et auto-hébergeable, pour rester maître de vos données et communications.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "HJofjCBj4s"
	},
	{
		"title": "Tout ce qu'il faut savoir sur le protocole LDAP Partie II : La pratique",
		"author": "Mejri Issam",
		"page": 90,
		"description": "Si vous êtes en train de lire cet article, c'est que vous avez de la chance ! Pourquoi ? Car vous allez découvrir le serveur LDAP de référence OpenLDAP et également tout ce qui est nécessaire pour une prise en main rapide et efficace, notamment dans un environnement de production. Vous aurez l'occasion de parcourir OpenLDAP depuis son installation, jusqu'à la configuration poussée de ce dernier et par conséquent une maîtrise parfaite de son implémentation en tant que service fondamental dans une infrastructure réseau de moyenne ou grande taille.",
		"date": "2016-03-01T00:00:00.000Z",
		"displayed_date": "Mars/Avril 2016",
		"number": 94,
		"url": "https://boutique.ed-diamond.com/linux-pratique/928-linux-pratique-94.html",
		"type": "lp",
		"id": "rkhziRrjVo"
	},
	{
		"title": "Jouez à l'architecte avec Sweet Home 3D",
		"author": "Stéphane Mourey",
		"page": 8,
		"description": "En février, sortait la version 5.2 de Sweet Home 3D. Voici l'occasion de revenir sur ce logiciel à la fois ludique et utile, dont chacun de nous peut avoir besoin. Sweet Home 3D se présente en effet comme un \"logiciel d'aménagement d'intérieur\", mais en réalité ses possibilités sont si vastes que vous pourriez vous prendre pour un véritable architecte",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "H1Tzs0HjVi"
	},
	{
		"title": "Montez son serveur de mails : Partie 2",
		"author": "Cédric Pellerin",
		"page": 19,
		"description": "Dans le précédent numéro, nous avons vu comment monter un serveur Postfix et le paramétrer. Dans cette seconde partie, nous allons voir comment ajouter des fonctionnalités à notre serveur en ce qui concerne l'anti-spams et la réception des e-mails.",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "HJAfjRBsVi"
	},
	{
		"title": "La meilleure distribution universelle n'existe pas",
		"author": "Stéphane Blondon",
		"page": 28,
		"description": "Pourquoi est-il impossible d'avoir une réponse définitive à la question récurrent de la meilleure distribution Linux ? Si la question suscite de vifs débats, c'est plus souvent dû à une relation passionnelle à l'une d'entre elles qu'à un raisonnement rationnel...",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "HkymsAHjEo"
	},
	{
		"title": "DuckDuckGo, le moteur qui ne vous profile pas",
		"author": "Vincent Magnin",
		"page": 32,
		"description": "Quand vous utilisez un moteur de recherche tel que GOogle, il vous profile dans le but de personnaliser les résultats et les publicités qui vous sont envoyés. DuckDuckGo, lui, n'enregistre aucune information sur vous",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "Syemi0BiEi"
	},
	{
		"title": "Mise en place d'une solution de rediffusion de la TNT à la maison",
		"author": "Arnaud Février",
		"page": 38,
		"description": "Le 5 avril la TNT est passée à la HD. Cet événement et la multiplication des écrans dans nos chaumières permettent d'imaginer de nouveaux usages. Celui que nous allons envisager dans cet article consiste à mettre en place une station de rediffusion domestique. AInsi depuis n'importe quel écran de la maison, il sera possible de capter n'importe quelle chaîne de télévision.",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "S1bQjRBiEi"
	},
	{
		"title": "Encodez vos vidéos en H.265/HEVC",
		"author": "Hervé Massicot",
		"page": 46,
		"description": "Avec chaque nouvelle année, son lot de résolutions, et une de mes résolutions 2016 est de convertir mes vidéos personnelles qui s'accumulent sur mon disque et prennent de plus en plus de place. Je me suis donc mis en tête d'écrire un script de conversion adapté à la tâche. L'outil qui me semblait le plus adapté est notre bon vieux ffmpeg (16 ans déjà!) capable depuis quelques années d'encoder nos vidéos au format \"actuel\" H.264, largment supporté par de nombreux appareils. Mais j'ai voulu m'intéresser à une autre norme plus récente : HEVC, qui se veut être le prochain standard et promet des performances sur la compression tout en améliorant la qualité d'image.",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "r1fXjArjNs"
	},
	{
		"title": "Utilisez des claviers alternatifs plus judicieux sous Android",
		"author": "Arnaud Février",
		"page": 52,
		"description": "Même sur les systèmes conviviaux les plus réussis, il faut parfois utiliser le langage articulé et entrer des vrais mots avec de vraies lettres. Android propose quelques claviers utilisables, mais il en existe bien d'autres plus pratiques.",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "Sy7msASi4o"
	},
	{
		"title": "Comprenez vos visiteurs avec Piwik",
		"author": "Hervé Massicot",
		"page": 56,
		"description": "Si je vous dis \"web analytics\", il est fort à parier que vous me parliez de Google Analytics, un des ténors du secteur. Facile à mettre en oeuvre, séduisant par sa palette d'outils et de services intégrés, il n'en reste pas moins un outil de la galaxie Google. Et en général, se pose la question des données collecées. Piwik fait partie de ces solutions qui proposent une alternative crédible à Google Analytics. En effet, outre le fait d'être open source, il permet d'héberger soi-même les données générées par l'analyse du trafic de son site web. Il n'a rien à envier à Google Analytics en termes de fonctionnalités et c'est même l'outil de mesure d'audience recommandé par la CNIL pour respecter les lois sur la protection des données.",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "ByNQi0riNs"
	},
	{
		"title": "LESS: Optimisez votre travail sur les CSS",
		"author": "Stéphane Mourey",
		"page": 64,
		"description": "Less est un générateur de CSS. Ecrit en Javascript, il peut même être perçu comme une façon d'étendre les CSS pour leur offrir de nouvelles possibilités au sein du navigateur. Conçu comme un véritable langage, sa syntaxe permet un développement plus rapide, une implémentation plus cohérente et une maintenance facilitée des styles de votre site.",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "HJB7iRrsVi"
	},
	{
		"title": "Qu'est-ce que l'open data : introduction & mise en pratique",
		"author": "Tris Acatrinei",
		"page": 78,
		"description": "L'open data permet à tout un chacun de faire des choses assez fascinantes, qui peuvent même s'avérer dérangeantes pour certains acteurs. Quels sont les contours de l'open data ? Qu'avons nous le droit de faire avec les données mises à disposition ? Quelles sont les interactions de l'open data avec la vie privée et la propriété intellectuelle classique ?",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "HyImiAHoVo"
	},
	{
		"title": "MicroAlg, un langage pour grands débutants",
		"author": "Christophe Gragnic",
		"page": 84,
		"description": "Rares sont les langages de programmation qui ont été conçus dans un but pédagogique : Logo, Pascal et quelques autres... MicroAlg s'appuie sur cet héritage et propose un langage avec des mots-clés en français, utilisable avec un éditeur en local ou dans le navigateur, avec du code textuel ou des blocs à déplacer.",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "S1D7oAHoNj"
	},
	{
		"title": "La sauvegarde dee vos équipements réseau avec RANCID",
		"author": "Benoît Benedetti",
		"page": 94,
		"description": "Bien que vos équipements réseaux n'hébergent pas de données, vos switches et pare-feu nécessient que vous ayez une stratégie de sauvegarde afin de pouvoir les reconfigurer rapidement. Alors, à moins que vous ayez déjà adopté une solution de gestion de configuration automatisée et centralisée de ces équipements, je vous propose de découvrir RANCID pour effecter leur sauvegarde.",
		"date": "2016-05-01T00:00:00.000Z",
		"displayed_date": "Mai/Juin 2016",
		"number": 95,
		"url": "https://boutique.ed-diamond.com/linux-pratique/938-linux-pratique-95.html",
		"type": "lp",
		"id": "BydQjCSs4i"
	},
	{
		"title": "Réaliser son dossier de permis de construire avec Blender et LibreCAD",
		"author": "Laurent Delmas",
		"page": 8,
		"description": "Blender est bien connu pour son utilisation dans le monde multimédia avec les films d'animation Elephants Dream, Big Buck Bunny et SIntel, ainsi que dans de grands métrages hollywoodiens. Quand à LibreCAD, c'est une alternative au logiciel AutoCAD utilisé en architecture et en mécanique. Nous allons réaliser la conception 3D d'un bâtiment architectural avec Blender et utiliser LibreCA pour la mise en page des plans nécessaires à la constitution d'un dossier de permis de construire.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "rJFXsRHjEo"
	},
	{
		"title": "Enrichier sa diffusion de contenus multimédias avec OBS",
		"author": "Lucile Lapierre & Nicolas Greneche",
		"page": 18,
		"description": "Le terme \"visioconférence\" implique une multitude de projections en terme d'infrastructure de diffusion. Cela va d'une simple conversation vidéo point à point type Skype à une réunion impliquant des gens éloignés géographiquement et de multiples supports (diaporama, fichiers multimédias, etc.) avec du matériel dédié. Cet article introduit Open Broadcaster Software (OBS), un logiciel libre proposant de gérer et enrichier vos diffusions vidéos.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "BJ9XsArjVs"
	},
	{
		"title": "Etalonner son écran avec des outils libres",
		"author": "Benoît Benedetti",
		"page": 24,
		"description": "Que vous soyez photographe, vidéaste ou graphiste, professionnel ou amateur, l'étalonnage (ou son anglicisme calibration) de votre écran est essentiel si vous voulez restituer le plus difèlement possible vos photos, vidéos et autres réalisations graphiques.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "B1o7iCSoVo"
	},
	{
		"title": "Protégez votre vue et votre sommeil avec Redshift",
		"author": "Vincent Magnin",
		"page": 32,
		"description": "Rester tard le soir devant son écran n'est pas recommandé pour votre sommeil. Et la lumière bleue de vos écrans suscite actuellement des interrogations. Avec Redshift, vous pouvez atténuer les effets négatifs du travail sur écran.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "BJn7iRHoEi"
	},
	{
		"title": "Protégez vos données : utilisez des supports chiffrés",
		"author": "Arnaud Février",
		"page": 36,
		"description": "Les installations classiques des systèmes d'exploitation utilisent un disque dur non chiffré. Le système d'exploitation peut protéger les données des utilisateurs lorsqu'il est en fonctionnement, mais un indélicat peut, s'il a un accès physique à la machine, arrêter celle-ci, extraire le disque dur, et lire les données. Pour se protéger contre ces pratiques, la solution consiste à chiffrer le disque dur.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "SJTQjArsNs"
	},
	{
		"title": "YunoHost, l'auto-hébergemenbt à portée de main",
		"author": "Annaïg Denis",
		"page": 44,
		"description": "Comment faire pour héberger chez soi les différents services et applications que l'on utilise afin de préserver sa vie privée ? Une des solutions se trouve dans la distribution YunoHost qui permet d'installer un serveur de courriels et un serveur XMPP ainsi que de nombreuses applications. Ce tutoriel présente ainsi l'installation et a configuration de YunoHost avec comme base une brique internet, un nano-ordinateur faisant office de serveur. Nous avons choisi d'y installer OwnCloud pour ses services d'agenda, de carnet d'adresses et de synchronisation de fichiers, ainsi que le webmail Roundcube et le client XMPP Jappix. Les applications de la brique internet permettent en outre de simplement pouvoir configurer une connexion sécurisée VPN sur tous les appareils du domicile en intégrant un point d'accès Wifi.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "HJCQo0ro4j"
	},
	{
		"title": "Test de la tablette Aquaris M10 Ubuntu Edition",
		"author": "Benoît Benedetti",
		"page": 56,
		"description": "Alors que Firefox OS vient tout juste d'être abandonné, Canonical continue d'essayer de proposer une alternative à Android et iOS. Nous allons dans cet article voir les dernières nouveautés de son système mobile Ubuntu Touch, qui se veut convergent, en testant la première tablette supportant officiellement ce système, l'Aquaris M10 Ubuntu Edition.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "SkyEsASsEs"
	},
	{
		"title": "HashOver : autorisez les commentaires sur vos sites statiques",
		"author": "Stéphane Mourey",
		"page": 62,
		"description": "Les sites et même les blogs statiques on le vent en poupe, notamment grâce à Jekyll, non sans raison : efficacité, performance, séurité, ils constituent une solution idéale lorsque l'on n'a pas besoin d'un Wordpress ou d'un autre CMS. Une seule chose leur fait défaut : les commentaires des visiteurs. Pour remédier à cela, découvrons aujourd'hui HashOver !",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "HJl4oArsNi"
	},
	{
		"title": "Friendica : un réseau pour les gouverner tous ?",
		"author": "Stéphane Mourey",
		"page": 67,
		"description": "Je vous vois froncer les sourciels. A quoi bon un autre réseau social ? N'en n'avons nous pas déjà assez ? Y compris des réseaux libres ? Certes, mais Friendica est différent, notamment grâce à sa capacité à communiquer avec les autres services.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "SkbNoABoEj"
	},
	{
		"title": "Manipuler des données avec Drupal",
		"author": "Tris Acatrinei",
		"page": 77,
		"description": "Avec l'essor de l'open data et la mise à disposition par des entités publiques ou privées d'un grand nombre de données, les initiatives permettant leurs croisements se développent. Mais encore faut-il pouvoir les intégrer dans un outil. Le présent article va vous expliquer comment le faire avec l'un des CMS/framework les plus robustes du marché : Drupal.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "r1zNi0Bo4j"
	},
	{
		"title": "Surveillez automatiquement le programme de la TNT avec Python",
		"author": "Vincent Magnin",
		"page": 84,
		"description": "La concision et la puissance de Python vont nous permettre d'écrire rapidement un petit script pour surveiller automatiquement le programme des nombreuses chaînes de la TNT.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "HJ74sASsVi"
	},
	{
		"title": "gérez vos projets agiles avec Taïga",
		"author": "Sébastien Chazallet",
		"page": 92,
		"description": "Taiga est une plateforme de gestion de projets agiles dont l'utilisation est à la fois simple et agréable. Gratuite et libre, puissante, mais très accessible et vraiment efficace, elle est l'outil idéal, que vous soyez indépendant ou une équipe de développeurs utilisant la méthode SCRUM.",
		"date": "2016-07-01T00:00:00.000Z",
		"displayed_date": "Juillet/Août 2016",
		"number": 96,
		"url": "https://boutique.ed-diamond.com/linux-pratique/1061-linux-pratique-96.html",
		"type": "lp",
		"id": "HkV4sCSiNs"
	}
]